# RevitServerCommunicationException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitServerCommunicationException Class
Members See Also
---
The exception that is thrown when there is any network communication error happening.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class RevitServerCommunicationException : RevitServerException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class RevitServerCommunicationException _
	Inherits RevitServerException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class RevitServerCommunicationException : public RevitServerException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..RevitServerException Autodesk.Revit.Exceptions..::..RevitServerCommunicationException
# See Also
RevitServerCommunicationException Members
Autodesk.Revit.Exceptions Namespace